Catalogs/ро_Оборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ро_Оборудование</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодR3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Диаметр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Давление</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучКорДавления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХодШтока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПружины</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ро_Пружины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаГОСТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>222</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаДатаПрибора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтроительнаяДлина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПечФорма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПечатныеФормы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьВДокументах</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДокументовДЛяПечФорм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаименованиеДляКонтрагента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеКА</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>222</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Дефектовка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Деталь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДеталиОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дефект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Дефекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Годен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реставрация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изготовление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Покупка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипМаркаДетали</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>33</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ро_Оборудование/Ext/ManagerModule.bsl
Функция ПолучитьЧислоИзСтр(стр,Прямой)
	
	Стр = СтрЗаменить(Стр,",",".");
	
	Рез = "";
	был46 = Ложь;
	колПромахов=0;
	
	Если Прямой Тогда
		ДЛя а=1 по СтрДлина(стр) Цикл
			п = Сред(Стр,а,1);
			Если  КодСимвола(п,1) = 46 Тогда
				Если был46 Тогда
					прервать;
				КонецеСЛИ;
				Рез =  Рез + п;
				был46 = Истина;
			ИНачеЕсли (КодСимвола(п,1) >= 48 и КодСимвола(п,1)<= 57)   Тогда
				Рез =  Рез + п;
			ИНаче
				прервать;
			КонецЕсли;
		КонецЦикла;
		
	ИНаче
		ДЛя а=-СтрДлина(стр) по -1 Цикл
			п = Сред(Стр,-а,1);
			Если  КодСимвола(п,1) = 46 Тогда
				Если был46 Тогда
					прервать;
				КонецеСЛИ;
				Рез = п + Рез;
				был46 = Истина;
			ИНачеЕсли (КодСимвола(п,1) >= 48 и КодСимвола(п,1)<= 57)   Тогда
				Рез = п + Рез;
			ИначеЕсли колПромахов=0 и а=-СтрДлина(стр) Тогда
				колПромахов=колПромахов+1;
			ИНаче
				прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕСЛИ;
	
	Если Рез = "" ТОгда
		Возврат Неопределено;
	ИНАче
		Возврат Число(Рез);
	КонецЕсли;
	
КонецФункции

Функция РазобратьНаименование(Имя) Экспорт
	пСтр = СтрЗаменить(нрег(Имя),"-"," ");
	пСтр = Стрзаменить(пСтр,"*"," * ");
	пСтр = Стрзаменить(пСтр,"х"," * ");
	пСтр = Стрзаменить(пСтр,"x"," * ");
	пСтр = СтрЗаменить(пСтр," ",Символы.ПС);
	
	Для  а=2 по СтрЧислоСтрок(пстр)-1 Цикл
		п = СтрПолучитьстроку(пстр,а);
		Если п="*" Тогда
			Ч1 = ПолучитьЧислоИзСтр(СтрПолучитьСтроку(пСтр,а-1),Ложь);
			Если ч1 <> Неопределено ТОгда
				Ч2 = ПолучитьЧислоИзСтр(СтрПолучитьСтроку(пСтр,а+1),Истина);
				Если Ч2<>Неопределено Тогда
					Возврат Новый Структура("Ч1,Ч2",Ч1,Ч2);
				КонецЕСЛИ;
			КонецЕсли;
			
		КонецеслИ;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьДеталиДефектовки(сс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ро_ОборудованиеДефектовка.Деталь КАК Деталь,
	               |	ро_ОборудованиеДефектовка.Количество КАК Количество,
	               |	ро_ОборудованиеДефектовка.Дефект КАК Дефект,
	               |	ро_ОборудованиеДефектовка.Годен КАК Годен,
	               |	ро_ОборудованиеДефектовка.Реставрация КАК Реставрация,
	               |	ро_ОборудованиеДефектовка.Изготовление КАК Изготовление,
	               |	ро_ОборудованиеДефектовка.Покупка КАК Покупка
	               |ИЗ
	               |	Справочник.ро_Оборудование.Дефектовка КАК ро_ОборудованиеДефектовка
	               |ГДЕ
	               |	ро_ОборудованиеДефектовка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ссылка",сс);
	
	Тбл = Запрос.Выполнить().Выгрузить();
	
	Мас = новый Массив;
	Для каждого Стр из Тбл Цикл
		Стк = Новый Структура;
		Для каждого Кол из Тбл.Колонки Цикл
			Стк.Вставить(Кол.имя,Стр[Кол.имя]);
		КонецЦикла;
		Мас.добавить(Стк);
	КонецЦикла;
	
	Возврат Мас;
	
КонецФункции

Процедура ЗаполнитьДефектовку(сс) Экспорт
	
	Объект = сс.ПолучитьОбъект();
	Мас = ПолучитьДеталиДефектовки(Объект.Оборудование.Родитель);
	
	ОБъект.Дефектовка.Очистить();
	Для каждого эл из МАс Цикл
		новСтр = объект.Дефектовка.Добавить();
		ЗаполнитьЗначенияСвойств(новстр,Эл);
	КонецЦИкла;
	
	Объект.Записать();
	
	
КонецПроцедуры
